//ใช้ for + continue
#include <stdio.h>                  //เรียกฟังก์ชัน library มาตรฐาน

int main(){                         //ฟังก์ชันหลัก
    int i;                          //กำหนดตัวแปร i
    for (i = 1; i <= 10; i++){      //ให้ i = 1 , วนลูป 1 ถึง 10 , x จะบวก 1 หลังจบ loop body ในแต่ละรอบ
        if (i == 6){                //ตรวจสอบว่า i เท่ากับ 6 หรือไม่
            continue;               //ถ้าใช่ ข้ามไปรอบถัดไป (ไม่ทำprinf)
        }
        printf("%d ", i);           //แสดงค่า i (ไม่แสดงค่า 6)
    }
    return 0;                       //จบโปรแกรม
}

// === อธิบายการทำงานของโปรแกรม ===
// 1. กำหนดตัวแปร i
// 2. วนลูป 1 ถึง 10
// 3. ตรวจสอบว่า i เท่ากับ 6 หรือไม่
// 4. ถ้าใช่ ข้ามไปรอบถัดไป (ไม่ทำprinf)
// 5. แสดงค่า i (ไม่แสดงค่า 6)
// 6. ให้ i = i + 1 หลังจบ loop body ในแต่ละรอบ
// 7. จบโปรแกรม

// ดูสรุปความแตกต่างได้ที่ Coding_w09-03-3.c